

waiting_message = " لقد استقبلنا طلبك سوف يتم اضافتك في البوت في دقائق قليله من طرف الادمن شكرا على انتظارك 🥰"
full_name_message = 'الرجاء أكتب الإسم و اللقب الخاص بك'
phone_number_message = 'الرجاء أكتب رقم الهاتف الخاص بك'

welcome_message = "مرحبا بك عزيزي التاجر في البوت رقم واحد في البيع بالجملة كل من الاشتراكات والمنتوجات التي لها علاقة بالڨايمينڨ ( Xbox - Psn - Pc) 😍" 
welcome_message_2 = "• اهلأ بك عزيزي التاجر {name} 👋🏼 .\nنحن هنا لنوفر لكم كل منتجات جملة بأفضل اسعار 🤩\nمعلوماتك {pk}\nنقاطك   {balance}\n• قم بأختيار القسم الذي تريده من الاسفل 👇🏽."

admin_msg = """
الزبون: {user} 
إشترى المنتوج: {pack} 
بسعر : {price}
الآن
"""
history_msg = """
🌀 مرحباً بك في قسم معلومات حسابك ببوت المتجر! 🌀

رصيد حسابك الحالي: {balance} نقطة

إحصائيات حسابك:
- 🛒 السلع التي اشتريتها: {orders}
- 💸 الرصيد الذي استخدمته: {used_balance} نقطة
\n
"""
balance_msg = """
🌀 مرحباً بك في قسم معلومات رصيدي ببوت المتجر! 🌀

رصيد حسابك الحالي: {balance} نقطة
\n
""" 
contact_us_msg = """
تريد ايداع شكوى او استفسار امر ما تواصل معنا من هنا : 
☎️ رقم الهاتف 0794909201
واتساب 213794909201+
تيليڨرام Skilled04@
"""

products_msg = """
اختر عرض من هذه العروض
"""

packs_msg="""
اختر المنتوج الذي تريد شراؤه
"""

buy_msg = """
🔖 اسم السلعة: {pack}
📝 وصف السلعة: {description}

💲 السعر الحالي: {price} نقطة
✅ حالة التوفر: {count}

❓ - هل أنت متأكد من رغبتك في الشراء؟
"""

success_msg = """
🎉 عملية شراء ناجحة! 🎉

💸 تم خصم {price} نقطة بنجاح!

🎁 السلعة التي اخترتها هي:
 
{code}
"""

ask_for_balance_msg = """
تريد شحن حسابك لشراء منتجاتنا تواصلوا معنا هنا: 
☎️ رقم الهاتف 0794909201
📱واتساب 213794909201+
✉️ تيليڨرام Skilled04@
"""

error_msg = "رصيدك غير كاف"